"use client";

import React, { useEffect, useState, Fragment } from "react";

const AboutTopics = ({ Topic }: { Topic: string }) => {
  const [head, sethead] = useState("");
  const [data, setdata] = useState("");
  useEffect(() => {
    if (Topic == "ติดต่อเรา") {
      sethead(Topic);

    } else if (Topic == "เกี่ยวกับ โคโคนัท ซอฟต์") {
      sethead(Topic);
      setdata(
        "เกี่ยวกับ โคโคนัท ซอฟต์ (Coconutsoft online)" +
        "   " +
        "โคโคนัท ซอฟต์ เป็นร้านค้าออนไลน์ที่มีครบวงจรในการขายและจำหน่ายอุปกรณ์อิเล็กทรอนิกส์ทุกประการ ทำให้การช้อปปิ้งกลายเป็นประสบการณ์ที่ง่าย สะดวก และปลอดภัย" +
        "ผ่านหน้าจอคอมพิวเตอร์ สมาร์ทโฟน หรือแท็บเล็ต โดยไม่ต้องเสียเวลาเดินทางไปร้านค้า  สินค้าที่โคโคนัท ซอฟต์ เรามีสินค้ามากมายที่ครอบคลุม" +
        "ทุกความต้องการของท่าน ตั้งแต่สมาร์ทโฟน แท็บเล็ต โน้ตบุ๊ค อุปกรณ์เสริม คอมพิวเตอร์ประกอบ ไปจนถึงเกมมิ่งเกียร์และอุปกรณ์ไอทีสำหรับองค์กร" +
        "และสินค้าทันสมัยอีกมากมาย การันตีคุณภาพสินค้า พร้อมโปรโมชั่นสินค้าราคาพิเศษ" +
        "โคโคนัท ซอฟต์ มุ่งมั่นในการนำเสนอทางเลือกใหม่ในการช้อปปิ้ง ตอบโจทย์ไลฟ์สไตล์ของคนยุคใหม่ โดยเราคัดสรรสินค้าที่ทันสมัยอยู่เสมอ" +
        "การศึกษาเกี่ยวกับสินค้าเป็นสิ่งสำคัญ เพื่อเสริมความรู้พื้นฐานและทำให้ท่านตัดสินใจซื้ออุปกรณ์คอมพิวเตอร์ได้อย่างมั่นใจ เราขอเสนอคำแนะนำในการค้นหาข้อมูลเกี่ยวกับ" +
        "โคโคนัท ซอฟต์ ล่วงหน้า เพื่อให้ท่านได้รับบริการที่มีความเชื่อถือและดีที่สุด" +
        "ทางเรายินดีให้บริการด้วยความจริงใจนำเสนอประสบการณ์การช้อปปิ้งที่สะดวก รวดเร็ว ตัวเลือกหลากหลาย  เลือกซื้อสินค้าที่ตรงใจ ในราคาคุ้มค่า" +
        "ทาง โคโคนัท ซอฟต์ คู่หูไอทีของคุณพร้อมที่จะให้คำปรึกษาและความช่วยเหลือประกอบในการตัดสินใจ และติดตามโปรโมชั่นล่าสุดได้ที่เว็บไซต์  www.coconutsoftcreation.com"
      );
    } else if (Topic == "ข้อกำหนดและเงื่อนไข") {
      sethead(Topic);
    } else if (Topic == "การจัดส่งสินค้า") {
      sethead(Topic);
    } else if (Topic == "การคืนสินค้า") {
      sethead(Topic);
    } else if (Topic == "การคืนเงิน") {
      sethead(Topic);
    } else if (Topic == "การยกเลิกรายการสั่งซื้อสินค้า") {
      sethead(Topic);
    } else if (Topic == "นโยบายความเป็นส่วนตัว") {
      sethead(Topic);
    }
  }, [Topic]);
  if (Topic == "ติดต่อเรา") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md">
                    <p>บริษัท โคโคนัท ซอฟต์ ครีเอชั่น จำกัด อำเภอหาดใหญ่ จังหวัดสงขลา 90110 ที่อยู่ 43 ราษฎร์อุทิศ ซอย 10 ตำบลหาดใหญ่</p>
                    <p>โทรสอบถามเพิ่มเติม/สั่งซื้อสินค้าได้ที่ โทร.093-651-5111</p>
                    <p>เวลาทำการ : เปิด 09.30 - 17.00 น. *หยุดทุกวันเสาร์-อาทิตย์</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  } else if (Topic == "เกี่ยวกับ โคโคนัท ซอฟต์") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md">
                    <p>{data}</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  } else if (Topic == "ข้อกำหนดและเงื่อนไข") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md">
                    <p className="mb-2">
                      www.coconutsoftcreation.com ให้บริการโดย บริษัทโคโคนัท
                      ซอฟต์ การใช้เว็บไซต์นี้ถือว่า "ผู้ใช้" "คุณ" "ท่าน"
                      "ลูกค้า" หมายถึงบุคคลที่เข้าสู่เว็บไซต์นี้
                      ยอมรับและตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขเหล่านี้
                    </p>
                    <ol className="list-decimal list-outside ml-5">
                      <li>การใช้บริการหรือการทำธุรกรรมใดๆ กับเว็บไซต์นี้ถือว่าผู้ใช้ได้ยอมรับข้อกำหนดและเงื่อนไขทั้งหมด</li>
                      <li>ในการใช้บริการบางอย่างบนเว็บไซต์ คุณอาจต้องสมัครใช้งานบัญชีผู้ใช้ คุณต้องให้ข้อมูลที่ถูกต้องและครบถ้วนในการสมัครใช้งาน</li>
                      <p>* บริษัทมีสิทธิ์ในการระงับหรือยกเลิกบัญชีผู้ใช้ของคุณได้ทุกเมื่อ</p>
                      <li>การทำธุรกรรมทางการเงินผ่านเว็บไซต์นี้ต้องเป็นไปตามเงื่อนไขการชำระเงินที่ได้ระบุ</li>
                      <li>บริษัทฯไม่มีบริการ(service) การติดตั้งสินค้าทุกประเภท ของโคโคนัท ซอฟต์</li>
                      <li>บริษัทฯมีนโยบายการคืนเงินสำหรับสินค้าและบริการบางประเภท คุณสามารถดูรายละเอียดเพิ่มเติมเกี่ยวกับนโยบายการคืนเงินได้</li>
                      <li>บริษัทฯไม่รับประกันว่าเว็บไซต์จะใช้งานได้อย่างต่อเนื่องหรือปราศจากข้อผิดพลาด บริษัทฯจะไม่รับผิดชอบต่อความเสียหายใดๆ ที่เกิดขึ้นจากการใช้เว็บไซต์</li>
                      <li>เนื้อหาทั้งหมดบนเว็บไซต์นี้เป็นทรัพย์สินทางปัญญาของเว็บไซต์ www.coconutsoftcreation.com ห้ามทำซ้ำ, แก้ไข, หรือใช้ประโยชน์จากเนื้อหาโดยไม่ได้รับอนุญาต</li>
                      <li>บริษัทฯขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อกำหนดและเงื่อนไขต่างๆ โดยไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
                      <li>ข้อกำหนดและเงื่อนไขต่างๆ ต้องเป็นไปตามกฎหมายของประเทศไทย</li>
                    </ol>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  } else if (Topic == "การจัดส่งสินค้า") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md">
                    <p className="mb-2">โคโคนัท ซอฟต์ มีการให้บริการจัดส่งสินค้า ภายในระยะเวลา 3-7 วันทำการ ขึ้นอยู่กับพื้นที่ให้บริการ</p>
                    <ol className="list-decimal list-outside ml-5">
                      <li>บริษัทฯจะจัดส่งสินค้าหลังจากได้ตรวจสอบการชำระเงินเรียบร้อยแล้ว รายการสั่งซื้อที่ยืนยันการชำระเงินในวันนี้จะจัดส่งสินค้าในวันรุ่งขึ้น ทั้งนี้ถ้าไม่สามารถจัดส่งในวันนั้นได้ บริษัทฯขอสงวนสิทธ์ในการจัดส่งสินค้าในวันทำการถัดไป หรือตามข้อตกลงกับทางผู้ซื้อ</li>
                      <li>ลูกค้าอาจได้รับสินค้าในเวลาที่ต่างกัน สำหรับสินค้าแต่ละรายการในคำสั่งซื้อเดียวกัน และจำนวนกล่องสินค้าที่จัดส่งอาจแยกตามรายการสินค้า ทั้งนี้ บริษัทฯ จะพยายามจัดส่งสินค้าให้ลูกค้าได้รับอย่างรวดเร็วและครบถ้วนที่สุด ตามมาตรฐานการให้บริการของบริษัทฯ</li>
                      <li>การจัดส่งสินค้าให้กับลูกค้าอาจเกิดความล่าช้าจากเหตุสุดวิสัย เช่น จากภัยธรรมชาติ หรือ ผลกระทบทางการเมือง ซึ่งส่งผลให้เกิดความล่าช้าในการจัดส่งเกิน 7 วันทำการ หากเกิดกรณีดังกล่าวขึ้น ทางบริษัทฯ จะแจ้งให้ลูกค้าทราบถึงความล่าช้าที่เกิดขึ้นโดยเร็วที่สุด และจะพยายามอย่างเต็มที่เพื่อจัดส่งสินค้าให้ลูกค้าโดยเร็วที่สุด</li>
                      <li>เมื่อลูกค้าได้รับการแจ้งการจัดส่งสินค้า สินค้าจะถูกจัดส่งไปตามที่อยู่ปลายทางจัดส่ง ตามที่ลูกค้าระบุไว้ในขั้นตอนการทำรายการสั่งซื้อสินค้าเท่านั้นทางบริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงที่อยู่ในการจัดส่ง เมื่อสินค้ากำลังนำส่งโดยบริษัทฯ ขนส่งเอกชน เพื่อความสะดวกและรวดเร็วในการจัดส่งกรุณาตรวจสอบความถูกต้องของข้อมูลที่อยู่จัดส่งก่อนทำการสั่งซื้อสินค้า</li>
                      <li>เมื่อสินค้าถูกจัดส่งเรียบร้อยแล้ว เจ้าหน้าที่จะแจ้งยืนยันการจัดส่งสินค้า พร้อมทั้งแจ้งหมายเลขติดตามการขนส่งของสินค้า(Tracking Number) ลูกค้าสามารถตรวจสอบสถานะการจัดส่งสินค้าผ่านระบบการให้บริการของบริษัทขนส่งเอกชน โดยใส่รหัส เลขขนส่ง (Tracking Number) ที่แสดงอยู่ในรายการข้อมูลสั่งซื้อสินค้าของลูกค้า</li>
                    </ol>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  } else if (Topic == "การคืนสินค้า") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md">
                    <p className="mb-2">ทางบริษัทโคโคนัท ซอฟต์ ครีเอชั่น จำกัด มีนโยบายการคืนสินค้า ในกรณีที่ระบุไว้ภายใต้เงื่อนไขที่กำหนดเท่านั้น โดยบริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขการคืนสินค้าโดยไม่ต้องแจ้งให้ทราบล่วงหน้า</p>
                    <ol className="list-decimal list-outside ml-5">
                      <li>กรุณาติดต่อบริษัทฯเพื่อแจ้งการคืนสินค้าภายใน 3 วัน นับตั้งแต่วันที่ได้รับสินค้า </li>
                      <li>กรณีที่สามารถคืนสินค้าได้ คือสินค้าที่ได้รับไม่ตรงกับรายการที่สั่งซื้อ, สินค้ามีตำหนิ หรือ เสียหาย</li>
                      <li>กรณีที่ไม่สามารถคืนสินค้าได้ คือสินค้าที่มีสภาพไม่สมบูรณ์ มีการแกะ ฉีกขาด หรือแตกต่างจากสภาพเดิมก่อนส่งสินค้า ที่มีสภาพไม่พร้อมต่อการขาย จะไม่สามารถรับเปลี่ยนหรือคืนสินค้าได้</li>
                      <li>ลูกค้าทำการจัดเตรียมสินค้าส่งคืน โดยสินค้าต้องมีสภาพสมบูรณ์ ไม่ผ่านการใช้งาน มีบรรจุภัณฑ์เดิมทุกอย่าง เหมือนเช่นเดียวกับตอนที่ได้รับสินค้าจากบริษัทฯ</li>
                      <li>ในกรณีที่สินค้าถูกส่งกลับคืนมายังบริษัทฯ เนื่องจากข้อมูลที่ลูกค้าให้ไว้มีความผิดพลาด ลูกค้าต้องชำระค่าจัดส่งสินค้าใหม่อีกครั้ง</li>
                      <li>บริษัทฯ จะดำเนินการคืนเงินค่าสินค้าและค่าขนส่ง (ถ้ามี) ให้กับลูกค้า ผ่านช่องทางการชำระเงินเดิม ภายใน 15 – 30 วัน</li>
                    </ol>
                    <p className="my-2">* ในการคืนสินค้า กรุณาติดต่อเจ้าหน้าที่ทางโทรศัพท์ 093-651-5111 ในวันจันทร์-วันศุกร์ เวลา 09.30-17.00 น. ยกเว้นวันหยุดนักขัตฤกษ์</p>
                    <h2 className="my-2 font-semibold text-lg">เอกสารที่ใช้ประกอบการคืนสินค้าเพื่อรับเงินคืน</h2>
                    <ol className="list-decimal list-outside ml-5">
                      <li>ใบเสร็จรับเงิน (ฉบับจริง)</li>
                      <li>สำเนาหน้าบัญชีธนาคาร (Book Bank) จะต้องเป็นบัญชีเดียวกันกับบัญชีที่ชำระพร้อมเซ็นรับรองสำเนาถูกต้อง เพื่อให้บริษัท โอนเงินค่าสินค้าและค่าขนส่งคืน</li>
                      <li>สำเนาบัตรประชาชน พร้อมเซ็นรับรองสำเนาถูกต้อง</li>
                      <li>ที่อยู่ในการจัดส่งสินค้าคืน</li>
                    </ol>
                    <h2 className="font-semibold my-2 text-lg">ที่อยู่ในการจัดส่งสินค้าคืน</h2>
                    <p>โคโคนัท ซอฟต์ ครีเอชั่น จำกัด</p>
                    <p>ที่อยู่ 43 ราษฎร์อุทิศ ซอย 10 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110 โทรศัพท์ 093-651-5111</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  } else if (Topic == "การคืนเงิน") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md">
                    <ol className="list-decimal list-outside ml-5">
                      <li>บริษัทฯขอสงวนสิทธิ์ในการคืนเงินค่าสินค้า ในกรณีที่สินค้ามีความผิดพลาดจากผู้ผลิต หรือส่งสินค้าผิด โดยทางบริษัทฯจักจัดส่งสินค้าใหม่ตามที่ท่านสั่งซื้อ รวมทั้งเป็นผู้รับผิดชอบในการจัดส่งสินค้า</li>
                      <li>บริษัทฯจะเปลี่ยนสินค้าเป็นชิ้นใหม่ในรุ่นเดิมเท่านั้น ในกรณีที่สินค้ารุ่นเดิมหมด บริษัทฯจะทำการคืนเงินให้ลูกค้า หรือเสนอสินค้าใกล้เคียงให้แทน</li>
                      <li>บริษัทฯจะทำการคืนค่าสินค้า โดยจะโอนค่าสินค้าพร้อมค่าส่งสินค้า(ภายใน 15-30 วัน) เข้าสู่บัญชีธนาคารที่มีชื่อเดียวกับผู้ซื้อสินค้าเท่านั้น</li>
                    </ol>
                    <h2 className="my-2 font-bold text-lg">เอกสารแนบในการคืนเงิน กรณี เงินสด</h2>
                    <h3 className="my-2 font-semibold">ลูกค้าทั่วไป/บุคคลธรรมดา</h3>
                    <ol className="list-decimal list-outside ml-5">
                      <li>สำเนาบัตรประชาชน เซ็นชื่อรับรองสำเนาถูกต้อง พร้อมระบุ "ใช้เพื่อขอรับเงินคืนจาก โคโคนัท ซอฟต์  เท่านั้น"</li>
                      <li>สำเนาหน้าบัญชีธนาคาร (Book bank)</li>
                      <li>สลิปการโอนเงิน/หลักฐานการชำระเงิน</li>
                    </ol>
                    <h3 className="my-2 font-semibold">ลูกค้านิติบุคคล</h3>
                    <ol className="list-decimal list-outside ml-5">
                      <li>สำเนาหนังสือรับรองบริษัทฯ และภพ.20</li>
                      <li>สำเนาหน้าบัญชีธนาคารของบริษัทฯ</li>
                      <li>สำเนาหลักฐาน/สลิปการชำระเงิน</li>
                    </ol>
                    <p className="mt-2">ทางบริษัทฯ ขอสงวนสิทธิ์ในการตรวจสอบเอกสารก่อนดำเนินการคืนเงิน</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  }
  else if (Topic == "การยกเลิกรายการสั่งซื้อสินค้า") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md ml-5">
                    <ol className="list-decimal list-outside">
                      <li>ลูกค้าสามารถยกเลิกคำสั่งซื้อก่อนที่สินค้าจะถูกจัดส่งไปยังที่อยู่ที่ระบุไว้ โดยทำการยกเลิกผ่านระบบออนไลน์หรือติดต่อฝ่ายบริการลูกค้าภายในระยะเวลาที่กำหนด</li>
                      <li>บริษัทฯขอสงวนสิทธิ์ในการยกเลิกคำสั่งซื้อผ่านทางเว็บไซต์ได้ทุกเมื่อ หากความผิดพลาดนั้นเกิดมาจากความผิดพลาดในการพิมพ์หรือความผิดพลาดที่มิได้มีการคาดการณ์ไว้ล่วงหน้า อันเป็นผลมาจากสินค้าในเว็บไซต์ที่มีการลงรายการไว้ไม่ถูกต้อง(ไม่ว่าจะเป็นการลงราคาผิด หรือลงรายละเอียดที่ผิด เป็นต้น) ทางบริษัทโคโคนัท ซอฟต์จะพยายามนำเสนอราคาและรายละเอียดของผลิตภัณฑ์บนแพลตฟอร์มอย่างถูกต้องและแม่นยำที่สุดเท่าที่เราสามารถทำได้ และหากพบข้อผิดพลาดทางบริษัทฯ จะแจ้งให้ท่านทราบโดยเร็ว</li>
                      <li>ในกรณีที่รายการสั่งซื้อนั้นถูกยกเลิกขึ้น และบริษัทฯได้รับการชำระเงินสำหรับการสั่งซื้อนั้นเสร็จสมบูรณ์เรียบร้อยแล้ว บริษัทจะดำเนินการคืนเงินให้ท่านตามนโยบายคืนเงินของบริษัทฯทั้งจำนวนราคาสินค้า (รวมถึงค่าจัดส่ง หากมี) </li>
                    </ol>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  }
  else if (Topic == "นโยบายความเป็นส่วนตัว") {
    return (
      <>
        <div className="col-span-9">
          <div id="SHOW_CONTENT_ABOUT" className="fade-custom-up">
            <div className="">
              <div className="d-flex justify-content-start align-items-center pb-3">
                <h1 className="m-0 text-2xl font-semibold text-someGreen">{head}</h1>
              </div>
              <div className="row">
                <div className="col-12">
                  <div className="text-gray-900 text-md">
                    <p>บริษัทโคโคนัท ซอฟต์ ให้ความสำคัญกับความเป็นส่วนตัวของลูกค้าที่จะให้ข้อมูลเกี่ยวกับข้อมูลส่วนบุคคลที่เราเก็บรวบรวมและวิธีการใช้ข้อมูล นโยบายทางบริษัทฯ มีวัตถุประสงค์เพื่อคุ้มครองความเป็นส่วนตัวของท่านและสร้างความไว้วางใจในการทำธุรกรรมออนไลน์กับเรา </p>
                    <p className="my-2 font-semibold text-lg">การจัดเก็บข้อมูลส่วนบุคคล</p>
                    <p>บริษัทฯจะเก็บข้อมูลด้วยความสมัครใจของท่านและข้อมูลที่จำเป็นเท่านั้น โดยข้อมูลนั้นต้องเป็นข้อมูลที่ถูกอัพเดตให้ล่าสุดอยู่เสมอ เพื่อให้บริการในการดำเนินการซื้อขายและปรับปรุงบริการตามความต้องการของท่าน ข้อมูลที่เราเก็บรวบรวมอาจรวมถึงชื่อ-สกุล/ที่อยู่/หมายเลขโทรศัพท์/อีเมล/ข้อมูลการชำระเงิน /ข้อมูลการจัดส่ง, หากท่านให้ข้อมูลบุคคลอื่นกับบริษัทฯ ทางบริษัทฯจะถือว่าท่านได้รับอนุญาตจากบุคคลท่านนั้นเเล้ว และจะไม่รับผิดชอบหากท่านให้ข้อมูลบุคคลอื่น โดยที่บุคคลนั้นไม่ได้อนุญาตในการให้ข้อมูล</p>
                    <h3 className="my-2 font-semibold text-lg">จุดประสงค์ในใช้ข้อมูล </h3>
                    <ol className="list-decimal list-outside ml-5">
                      <li>เพื่อดำเนินการสั่งซื้อของคุณที่ได้สั่งสินค้าผ่านเว็บไซต์  www.coconutsoftcreation.com</li>
                      <li>เพื่อใช้ข้อมูลการจัดส่งของคุณ ในการจัดส่งสินค้าให้กับคุณ ข้อมูลนี้จะถูกแบ่งปันกับบริษัทขนส่งสินค้า</li>
                      <li>เพื่อใช้ข้อมูลการติดต่อสื่อสารของคุณ ในการติดต่อสื่อสารเกี่ยวกับคำสั่งซื้อของคุณ ข้อมูลนี้จะไม่ถูกแบ่งปันกับบุคคลที่สาม</li>
                      <li>เพื่อพัฒนาและปรับปรุงเว็บไซต์ วิเคราะห์ข้อมูลเพื่อนำเสนอสินค้าและบริการที่ตรงใจ</li>
                    </ol>
                    <h3 className="my-2 font-semibold text-lg">วิธีการป้องกันความปลอดภัยของข้อมูลส่วนบุคคล</h3>
                    <p>เราใช้มาตรการทางเทคโนโลยีและองค์กรเพื่อปกป้องข้อมูลของท่านจากการเข้าถึงโดยผู้ไม่ได้รับอนุญาต</p>
                    <h3 className="my-2 font-semibold text-lg">การเปลี่ยนแปลงนโยบาย</h3>
                    <p>เราอาจเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราวและจะแจ้งให้ท่านทราบเกี่ยวกับการเปลี่ยนแปลงบนเว็บไซต์  www.coconutsoftcreation.com เท่านั้น</p>
                    <h3 className="my-2 font-semibold text-lg">ช่องทางการติดต่อ</h3>
                    <p>หากท่านต้องการ แก้ไขหรือลบข้อมูลส่วนบุคคลของท่าน หากท่านมีคำถามหรือข้อสงสัยเกี่ยวกับนโยบายความเป็นส่วนตัว กรุณาติดต่อเราที่ เว็บไซต์ www.coconutsoftcreation.com  หรือ หมายเลขโทรศัพท์ 093-651-5111 </p>
                    <p className="mt-2">การใช้บริการของเราถือว่าท่านยินยอมกับนโยบายความเป็นส่วนตัวทั้งหมดที่ระบุไว้ข้างต้น</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  }
};

export default AboutTopics;
